org/reference/attention_allocation_in_open_source.org
:PROPERTIES:
:ID:       c106ce3e-d228-49be-a07d-44437e0562a5
:END:
#+title: Attention Allocation in Open Source

How does one appropriately allocate attention to open source projects?

* Limiting Attention with a Tiered APproach

Homebrew's lead maintainer Mike McQuaid limits his available attention by using
a tiered approach to managing contributions:

1. First-time contributors: need documentation, code quality checks etc.
2. Second-time contributors: provide a more detailed code review
3. Third-time contributors: warrants individual, focused attention, including
   providing mentorship, suggesting additional areas of contribution

* Redirecting to User Support Systems

Distribute costs by redirecting tasks to users (e.g. forums)

* Meeting Demands by Increasing Available Attention

Bring on more active contributors, or find ways to increase the personal
attention that can be expended on the project.
