content/posts/attention_allocation_in_open_source.md
+++
title = "Attention Allocation in Open Source"
author = ["Jethro Kuan"]
draft = false
+++

How does one appropriately allocate attention to open source projects?


## Limiting Attention with a Tiered APproach {#limiting-attention-with-a-tiered-approach}

Homebrew's lead maintainer Mike McQuaid limits his available attention by using
a tiered approach to managing contributions:

1.  First-time contributors: need documentation, code quality checks etc.
2.  Second-time contributors: provide a more detailed code review
3.  Third-time contributors: warrants individual, focused attention, including
    providing mentorship, suggesting additional areas of contribution


## Redirecting to User Support Systems {#redirecting-to-user-support-systems}

Distribute costs by redirecting tasks to users (e.g. forums)


## Meeting Demands by Increasing Available Attention {#meeting-demands-by-increasing-available-attention}

Bring on more active contributors, or find ways to increase the personal
attention that can be expended on the project.